src/DataProcessors/ПримерИспользованияДереваРешений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>ПримерИспользованияДереваРешений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/Титаник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>Титаник</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выживание</Name>
					<Type>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Класс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРодственниковПервогоПорядка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРодственниковВторогоПорядка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПосадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каюта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/Выживание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>Выживание</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выжил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыжил</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ПримерИспользованияДереваРешений/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбучитьМодель(Команда)
	ОбучитьМодельНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбучитьМодельНаСервере()
	
	Результат = Неопределено;
	
	
	Данные = ДеревоРешений.РазбитьДанныеНаТренировочныеИТестовые(ВыборкаТитаник(Истина), 0.2, 42);
	
	Предикторы = "Класс,Пол,Возраст,Тариф,КоличествоРодственниковПервогоПорядка,КоличествоРодственниковВторогоПорядка";
	Цель = "Выживание";
	
	ПараметрыМодели = Новый Структура;
	Упрощения = Новый Массив;
	Упрощения.Добавить(ТипУпрощенияДереваРешений.НеУпрощать);
	Упрощения.Добавить(ТипУпрощенияДереваРешений.Упрощать);
	ПараметрыМодели.Вставить("ТипУпрощения", Упрощения);
	ПараметрыМодели.Вставить("МинимальноеКоличествоСлучаев", ДеревоРешений.ПолучитьЧислаВДиапазоне(0, 12, 1));
	ПараметрыМодели.Вставить("МаксимальнаяГлубина", ДеревоРешений.ПолучитьЧислаВДиапазоне(2, 40, 2));
	
	НайденныеПараметры = ДеревоРешений.ПоискПараметровПоСетке(Данные.ТренировочныеДанные, Предикторы, Цель, ПараметрыМодели);
	
	Результат = СтрШаблон("Точность на тренировочных данных (кросс-валидация): %1%%
                           |Лучшие параметры:
                           |- МинимальноеКоличествоСлучаев = %2;
                           |- МаксимальнаяГлубина = %3;
                           |- ТипУпрощения = %4.",
						   Окр(НайденныеПараметры.Точность, 2),
						   НайденныеПараметры.ПараметрыМодели.МинимальноеКоличествоСлучаев,
						   НайденныеПараметры.ПараметрыМодели.МаксимальнаяГлубина,
						   НайденныеПараметры.ПараметрыМодели.ТипУпрощения);
	
						   
	РезультатОбучения = ДеревоРешений.ОбучитьМодельНаДанных(Данные.ТренировочныеДанные, Предикторы, Цель, НайденныеПараметры.ПараметрыМодели);
	АдресМодели = ПоместитьВоВременноеХранилище(РезультатОбучения, УникальныйИдентификатор);
	
	РезультатПрогноза = ДеревоРешений.ВыполнитьПрогноз(Данные.ТестовыеДанные, РезультатОбучения);
	
	Результат = Результат + Символы.ПС + Символы.ПС + СтрШаблон("Точность на тестовых данных: %1%%", Окр(РезультатПрогноза.Точность, 2));
		
КонецПроцедуры


&НаКлиенте
Процедура ПодготовитьФайлДляKaggle(Команда)
	
	ПолучитьФайл(ПодготовитьФайлДляKaggleНаСервере(), "submit.txt", Истина);
	
КонецПроцедуры


&НаСервере
Функция ПодготовитьФайлДляKaggleНаСервере()
	
	Данные = ВыборкаТитаник(Ложь);
	
	РезультатПрогноза = ДеревоРешений.ВыполнитьПрогноз(Данные, ПолучитьИзВременногоХранилища(АдресМодели));
	
	ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла, "utf-8");
	ЗаписьТекста.ЗаписатьСтроку("PassengerId,Survived");
	Для Каждого СтрокаТаблицы Из РезультатПрогноза.Прогноз Цикл
		ЗаписьТекста.ЗаписатьСтроку(СтрШаблон("%1,%2", Формат(СтрокаТаблицы.Идентификатор, "ЧРГ=; ЧГ="), ?(СтрокаТаблицы.ВыживаниеПрогнозЗначение = Перечисления.Выживание.Выжил, "1", "0")));
	КонецЦикла;
	ЗаписьТекста.Закрыть();
	
	АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
	УдалитьФайлы(ИмяФайла);
	
	Возврат АдресФайла;
	
КонецФункции


Функция ВыборкаТитаник(ТренировочныеДанные = Истина)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Титаник.Идентификатор,
	|	Титаник.Выживание,
	|	Титаник.Класс,
	|	Титаник.Имя,
	|	Титаник.Пол,
	|	Титаник.Возраст,
	|	Титаник.Тариф,
	|	Титаник.НомерБилета,
	|	Титаник.КоличествоРодственниковПервогоПорядка,
	|	Титаник.КоличествоРодственниковВторогоПорядка,
	|	Титаник.ПортПосадки,
	|	Титаник.Каюта
	|ИЗ
	|	РегистрСведений.Титаник КАК Титаник
	|ГДЕ
	|	(&ТренировочныеДанные
	|				И Титаник.Идентификатор < 892
	|			ИЛИ НЕ &ТренировочныеДанные
	|				И Титаник.Идентификатор >= 892)";
	Запрос.УстановитьПараметр("ТренировочныеДанные", ТренировочныеДанные);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

&НаСервере
Процедура ОбучитьМодель2НаСервере()
	
	Результат = Неопределено;
		
	Данные = ДеревоРешений.РазбитьДанныеНаТренировочныеИТестовые(ПолучитьИсходныеДанные(), 0.2, 42);
	
	Предикторы = "Класс,Пол,Возраст,Тариф,Титул,ПортПосадки,Одиночка,Возраст_Класс";
	Цель = "Выживание";
	
	ПараметрыМодели = Новый Структура;
	Упрощения = Новый Массив;
	Упрощения.Добавить(ТипУпрощенияДереваРешений.НеУпрощать);
	Упрощения.Добавить(ТипУпрощенияДереваРешений.Упрощать);
	ПараметрыМодели.Вставить("ТипУпрощения", Упрощения);
	ПараметрыМодели.Вставить("МинимальноеКоличествоСлучаев", ДеревоРешений.ПолучитьЧислаВДиапазоне(0, 12, 1));
	ПараметрыМодели.Вставить("МаксимальнаяГлубина", ДеревоРешений.ПолучитьЧислаВДиапазоне(2, 40, 2));
	
	НайденныеПараметры = ДеревоРешений.ПоискПараметровПоСетке(Данные.ТренировочныеДанные, Предикторы, Цель, ПараметрыМодели);
	
	Результат = СтрШаблон("Точность на тренировочных данных (кросс-валидация): %1%%
                           |Лучшие параметры:
                           |- МинимальноеКоличествоСлучаев = %2;
                           |- МаксимальнаяГлубина = %3;
                           |- ТипУпрощения = %4.",
						   Окр(НайденныеПараметры.Точность, 2),
						   НайденныеПараметры.ПараметрыМодели.МинимальноеКоличествоСлучаев,
						   НайденныеПараметры.ПараметрыМодели.МаксимальнаяГлубина,
						   НайденныеПараметры.ПараметрыМодели.ТипУпрощения);
	
						   
	РезультатОбучения = ДеревоРешений.ОбучитьМодельНаДанных(Данные.ТренировочныеДанные, Предикторы, Цель, НайденныеПараметры.ПараметрыМодели);
	АдресМодели = ПоместитьВоВременноеХранилище(РезультатОбучения, УникальныйИдентификатор);
	
	РезультатПрогноза = ДеревоРешений.ВыполнитьПрогноз(Данные.ТестовыеДанные, РезультатОбучения);
	
	Результат = Результат + Символы.ПС + Символы.ПС + СтрШаблон("Точность на тестовых данных: %1%%", Окр(РезультатПрогноза.Точность, 2));
	
КонецПроцедуры

Функция ПолучитьИсходныеДанные()
	
	Поток = Обработки.ПримерИспользованияДереваРешений.ПолучитьМакет("train_set").ОткрытьПотокДляЧтения();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(Поток);
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Выживание");
	Данные.Колонки.Добавить("Пол");
	Данные.Колонки.Добавить("Класс");
	Данные.Колонки.Добавить("Возраст");
	Данные.Колонки.Добавить("Титул");
	Данные.Колонки.Добавить("Тариф");
	Данные.Колонки.Добавить("ПортПосадки");
	Данные.Колонки.Добавить("Одиночка");
	Данные.Колонки.Добавить("Возраст_Класс");
	Для Каждого Элемент Из ПрочитатьJSON(ЧтениеJSON, Истина) Цикл
		НоваяСтрока = Данные.Добавить();
		НоваяСтрока.Выживание = Элемент["Survived"];
		НоваяСтрока.Пол = Элемент["Sex"];
		НоваяСтрока.Класс = Элемент["Pclass"];
		НоваяСтрока.Возраст = Элемент["Age"];
		НоваяСтрока.Титул = Элемент["Title"];
		НоваяСтрока.Тариф = Элемент["Fare"];
		НоваяСтрока.ПортПосадки = Элемент["Embarked"];
		НоваяСтрока.Одиночка = Элемент["IsAlone"];
		НоваяСтрока.Возраст_Класс = Элемент["Age*Class"];
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура ОбучитьМодель2(Команда)
	ОбучитьМодель2НаСервере();
КонецПроцедуры
